Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source2.tmx
Source language: en_us
Languages: ja

source: When you’re ready to create a new IntPairs instance, use a dictionary literal as the parameter to the IntPairs initializer.
ja: あなたが新しいIntPairsインスタンスを作成する準備ができたら、辞書リテラルをパラメータとしてIntPairsイニシャライザに使ってください。

source: Whenever you use a for-in loop with an array, set, or any other collection or sequence, you’re using that type’s iterator.
ja: あなたがfor-inループを配列、集合、または何らかの他のコレクションやシーケンスとともに使うときはいつでも、あなたはこの型のもつイテレータを使っています。

source: Whenever you use multiple iterators (or for-in loops) over a single sequence, be sure you know that the specific sequence supports repeated iteration, either because you know its concrete type or because the sequence is also constrained to the Collection protocol.
ja: あなたが複数のイテレータ（またはfor-inループ）をある単一のシーケンスに対して使うときはいつでも、その特定のシーケンスが繰り返される反復をサポートすると確実にあなたが知っているようにしてください、あなたがそれの具体的な型を知っているからかもしくはそのシーケンスもまたCollectionプロトコルに制約されるからかのどちらかで。

source: Whether the Decoder has an entry for the given key.
ja: Decoderが与えられたキーに対して登録項目を持つかどうか。

source: Whether the encountered value was null.
ja: 出くわした値がnullだったかどうか。

source: Whether using an option set or creating your own, you use the raw value of an option set instance to store the instance’s bitfield.
ja: あるオプションセットを使用するかあなた自身で作成する場合、あなたはオプションセットインスタンスの生の値を使って、そのインスタンスの持つビットフィールドを格納します。

source: While seemingly simple, this capability gives you access to a large number of operations that you can perform on any sequence.
ja: 外見上は単純である一方、この能力はあなたにたくさんの演算へのアクセスを与え、それはあなたがあらゆるシーケンス上で実行可能です。

source: With a RawRepresentable type, you can switch back and forth between a custom type and an associated RawValue type without losing the value of the original RawRepresentable type.
ja: RawRepresentable型で、あなたはあつらえの型と関連RawValue型との間を行ったり戻ったり切り替えることが元のRawRepresentable型の値の損失なしに可能です。

source: With these annotations, Swift imports the MyList type without using any implicitly wrapped optionals:
ja: これら注釈で、SwiftはMyList型を何らかの暗黙的にラップされるオプショナルを使うことなしにインポートします。

source: With this extension, any sequence with elements that conform to Numeric has the doublingAll() method.
ja: この拡張で、Numericに準拠する要素をもつあらゆるシーケンスは、doublingAll()メソッドを持ちます。

source: With this type and extension method, you can call .lazy.scan(_:_:) on any sequence to create a lazily computed scan.
ja: この型と拡張メソッドで、あなたは.lazy.scan(_:_:)をあらゆるシーケンス上で呼び出して、遅延に計算される走査を作成できます。

source: Within a section of code demarcated by the NS_ASSUME_NONNULL_BEGIN and NS_ASSUME_NONNULL_END macros, you only need to annotate the nullable type declarations.
ja: NS_ASSUME_NONNULL_BEGINとNS_ASSUME_NONNULL_ENDマクロによって境界線を引かれるコード区画内で、あなたはヌル可能性宣言に注釈を付ける必要だけがあります。

source: Without a nullability annotation or with a null_resettable annotation—Imported as implicitly unwrapped optionals
ja: ヌル可能性注釈なしまたはnull_resettable注釈あり — 暗黙的にアンラップされるオプショナルとしてインポートされます

source: Working with Foundation Ranges
ja: Foundation Rangeを扱う

source: Working with Subscribers
ja: 加入者を扱う

source: Wrappers for Algorithms
ja: アルゴリズムに対するラッパー

source: Writable Key Paths
ja: 書き込み可能なキーパス

source: Writing Failable Asynchronous APIs
ja: 失敗できる非同期APIを記述する

source: Writing code that depends on the completion handler being called is dangerous.
ja: 呼び出される完了ハンドラに頼るコードを書くことは危険です。

source: You also use this method to sort elements that conform to the Comparable protocol in descending order.
ja: あなたはまた、このメソッドを使ってComparableプロトコルに準拠する要素を降順でソートすることができます。

source: You apply the NS_SWIFT_NAME macro to an individual type, method, or function declaration in Objective-C.
ja: あなたは、NS_SWIFT_NAMEマクロを個別の型、メソッド、または関数宣言にObjective-Cにおいて適用します。

source: You are expected to construct and—if necessary—destroy objects there yourself, using the APIs on UnsafeMutablePointer<Element>.
ja: あなたは、オブジェクトの組み立てと—必要ならば—破壊をそこであなた自身で、UnsafeMutablePointer<Element>上でAPIを使って行うことを当然期待されます。

source: You can add extensions to extensible enumerations later in your Swift code.
ja: あなたは拡張をいくつか加えて、Swiftコードにおいて後で列挙を拡張できます。

source: You can also combine, exclude, or subtract the elements of two sets:
ja: あなたはまた、結合、排他、または差引を行えます。

source: You can also perform unconditional optional chaining by using the postfix ! operator.
ja: あなたはまた、無条件のオプショナル連鎖を実行することが、後置!演算子を使って行えます。

source: You can also reorder, combine, and rename parameters so the API matches other Swift APIs.
ja: あなたはまた、パラメータを再配列、結合、そして改名できます、それでそのAPIは他のSwift APIと調和します。

source: You can also use literals to specify values for one or more cases.
ja: あなたはまた、リテラルを使うことで値を１つ以上のケース節に指定することができます。

source: You can also use this operator to compare a non-optional value to an optional that wraps the same type.
ja: あなたはまた、この演算子を使って非オプショナル値を、同じ型をラップするオプショナル値と比較することができます。

source: You can annotate declarations in your Objective-C code to indicate whether an instance can have a null or nil value.
ja: あなたは、あなたのObjective-Cコードの中の宣言に注釈をつけることで、あるインスタンスがヌルまたはnil値を持つことが可能かどうかを指し示せます。

source: You can bridge between Set and NSSet using the as operator.
ja: あなたはSetとNSSetの間をas演算子を使ってブリッジできます。

source: You can build a sequence type that lazily computes the elements in the result of a scan:
ja: あなたは、ある走査の結果の中の要素それらを遅延に計算するシーケンス型を構築できます：

source: You can call both functions the same way: with a trailing closure and no other arguments.
ja: あなたは、両方の関数を同じ方法で呼び出せます：後付クロージャとともにそして他の引数なしで。

source: You can check the equality of instances of any BinaryInteger types using the equal-to operator (==).
ja: あなたは、何らかのBinaryInteger型のインスタンスの同等性を同等演算子（==）使って確認できます。

source: You can check the inequality of instances of any BinaryInteger types using the not-equal-to operator (!=).
ja: あなたは、何らかのBinaryInteger型のインスタンスの不等性を不等演算子（!=）使って確認できます。

source: You can compare instances of any BinaryInteger types using the greater-than operator (>), even if the two instances are of different types.
ja: あなたは、何らかのBinaryInteger型のインスタンスをより大きい演算子（>）を使って比較できます、２つのインスタンスが異なる型であるとしてもです。

source: You can compare instances of any BinaryInteger types using the greater-than-or-equal-to operator (>=), even if the two instances are of different types.
ja: あなたは、何らかのBinaryInteger型のインスタンスをより大きいか等しい演算子（>=）使って比較できます、２つのインスタンスが異なる型であるとしてもです。

source: You can compare instances of any BinaryInteger types using the less-than operator (<), even if the two instances are of different types.
ja: あなたは、何らかのBinaryInteger型のインスタンスをより小さい演算子（<）を使って比較できます、２つのインスタンスが異なる型であるとしてもです。

source: You can compare instances of any BinaryInteger types using the less-than-or-equal-to operator (<=), even if the two instances are of different types.
ja: あなたは、何らかのBinaryInteger型のインスタンスをより小さいか等しい演算子（<=）使って比較できます、２つのインスタンスが異なる型であるとしてもです。

source: You can confirm the data value’s underlying type by retrieving a non-nil value from intValue or by inspecting the type property.
ja: あなたは、データ値のもつ基礎をなす型を確認することが、非nil値をintValueから回収することによって、またはtypeプロパティを調査することによって可能です。

source: You can create a Counter instance from an integer value between 1 and 5 by using the init?(rawValue:) initializer declared in the RawRepresentable protocol.
ja: あなたはCounterインスタンスを１と５の間の整数値から作成することが、RawRepresentableプロトコルにおいて宣言されるinit?(rawValue:)イニシャライザを使うことによって可能です。

source: You can create a set with any element type that conforms to the Hashable protocol.
ja: あなたは、Hashableプロトコルに準拠するあらゆる要素型を使って集合を作成することができます。

source: You can expect faster execution when the collections share many common elements, or if Element conforms to Hashable.
ja: あなたはより速い遂行を予想できます、コレクションそれらが多くの普通の要素を共有する場合は、またはもしElementがHashableに準拠するならば。

source: You can expect faster execution when the collections share many common elements.
ja: あなたはより速い遂行を予想できます、コレクションそれらが多くの普通の要素を共有する場合は。

source: You can improve the architecture, logic, and performance of one of your Objective-C apps by replacing pieces of it in Swift.
ja: あなたは、あなたのObjective-Cアプリのうちの１つのアーキテクチャ、論理、そして性能を、それの幾つかの区画を置き換えることによって改善できます。

source: You can initialize the Countdown sequence with a starting integer and then iterate over the count down to zero.
ja: あなたは、Countdownシーケンスをある開始点整数で初期化してそれからカウントダウンをゼロまでずっと反復することができます。

source: You can iterate through a set’s unordered elements with a for-in loop.
ja: あなたは、集合の持つ順序付けられない要素を始めから終わりまで反復することがfor-inで可能です。

source: You can modify a set in place by using these methods’ mutating counterparts: formUnion(_:), formIntersection(_:), formSymmetricDifference(_:), and subtract(_:).
ja: あなたはある集合をその場で修正することがこれらのメソッドの変更を行う相当物：formUnion(_:)、formIntersection(_:)、formSymmetricDifference(_:)、そしてsubtract(_:)を使うことで可能です。

source: You can override any of the protocol’s required methods to provide your own custom implementation.
ja: あなたは、何らかのこのプロトコルの持つ必須メソッドをオーバーライドして、あなた独自のあつらえの実装を提供することができます。

source: You can reverse a collection without allocating new space for its elements by calling this reversed() method.
ja: あなたは、あるコレクションを逆順にすることがそれの要素に対して新しい空間を割り当てることなくreversed()メソッドによって可能です。

source: You can set up your Swift class to integrate Objective-C behavior by subclassing Objective-C classes, adopting Objective-C protocols, and more.
ja: あなたは、あなたのスウィフトクラスをObjective-Cクラスのサブクラスにすること、Objective-Cプロトコルを採用すること、そしてもっと多くのことによって、Objective-C挙動に溶け込むように準備することができます。

source: You can simplify the process of annotating your Objective-C code by marking entire regions as audited for nullability.
ja: あなたは、あなたのObjective-Cコードに注釈を付ける行程を領域全体をヌル可能性について監査されると印することによって簡素化できます。

source: You can sort any mutable collection of elements that conform to the Comparable protocol by calling this method.
ja: あなたはComparableプロトコルに準拠する要素からなるあらゆる可変の配列をこのメソッドを呼び出すことによってソートできます。

source: You can sort any sequence of elements that conform to the Comparable protocol by calling this method.
ja: あなたはいくらかの要素からなる何らかのシーケンスでComparableプロトコルに準拠するものをこのメソッドを呼び出すことによってソートする（並び替える）ことができます。

source: You can subscript a collection with any valid index other than the collection’s end index.
ja: あなたは、そのコレクションの末尾インデックスの以外のあらゆる有効なインデックスで、コレクションに対して添え字を使うことができます。

source: You can think of additional cases you might add later
ja: あなたが後で加えるかもしれない追加のケース節を考える可能性があるならば

source: You can use MemoryLayout as a source of information about a type when allocating or binding memory using raw pointers.
ja: あなたは、MemoryLayoutをある型についての情報源として使うことが、生のポインタを使ってメモリをアロケートまたはバインドする時に可能です。

source: You can use popLast() to remove the last element of a collection that might be empty.
ja: あなたはpopLast()を使って、空であるかもしれないコレクションの最後の要素を削除できます。

source: You can use a PartialRangeThrough instance of a collection’s indices to represent the range from the start of the collection up to, and including, the partial range’s upper bound.
ja: あなたは、あるコレクションのインデックスからなる、PartialRangeThroughインスタンスを使うことで、コレクションの始まりからこの部分範囲の上側の境界までの、そしてそれを含んでいる範囲を表すことができます。

source: You can use a PartialRangeThrough instance to quickly check if a value is contained in a particular range of values.
ja: あなたはPartialRangeThroughインスタンスを使うことで、ある値が特定の範囲に属するいくつかの値の中に含まれているかどうか素早く調べることができます。

source: You can use a PartialRangeUpTo instance of a collection’s indices to represent the range from the start of the collection up to, but not including, the partial range’s upper bound.
ja: あなたは、あるコレクションのインデックスからなる、PartialRangeUpToインスタンスを使うことで、コレクションの始まりからこの部分範囲の上側の境界までの、そしてそれを含んでいる範囲を表すことができます。

source: You can use a PartialRangeUpTo instance to quickly check if a value is contained in a particular range of values.
ja: あなたはPartialRangeUpToインスタンスを使うことで、ある値が特定の範囲に属するいくつかの値の中に含まれているかどうか素早く調べることができます。

source: You can use a Range instance to quickly check if a value is contained in a particular range of values.
ja: あなたはRangeインスタンスを使うことで、ある値が特定の範囲に属するいくつかの値の中に含まれているかどうか素早く調べることができます。

source: You can use a partial range of a collection’s indices to represent the range from the partial range’s lower bound up to the end of the collection.
ja: あなたは、あるコレクションのもつインデックスからなる部分範囲を使うことで、その部分範囲の下側の境界からそのコレクションの終わりまでの範囲を表すことができます。

source: You can use a partial range to quickly check if a value is contained in a particular range of values.
ja: あなたは、部分範囲を使って、ある値がいくつの値からなる部分範囲に含まれるかどうかを素早く調べることができます。

source: You can use an array literal anywhere a set is expected by the type context.
ja: あなたは、型コンテキストによって集合が予期される何処ででも配列リテラルを使うことができます。

source: You can use an enumeration to specify the exact states needed for your app.
ja: あなたは列挙を使って、あなたのアプリに必要とされる正確な状態を指定できます。

source: You can use nullability annotations in your Objective-C code to designate whether a parameter type, property type, or return type is nullable.
ja: あなたは、ヌル可能性注釈をあなたのObjective-Cコードにおいて使用して、パラメータ型、プロパティ型、または戻り値がヌル可能性であるかどうかを指定します。

source: You can use one of the ListFormatStyle static factory methods to create a custom list format style as a parameter to the method.
ja: あなたは、ListFormatStyle静的ファクトリメソッドの１つを使って、あつらえのリスト書式形式をこのメソッドへのパラメータとして作成できます。

source: You can use the relative(to:) method to convert a range expression, which could be missing one or both of its endpoints, into a concrete range that is bounded on both sides.
ja: あなたは、relative(to:)メソッドを使うことによって、それの端点の両方または１つを抜かすことができる範囲式を、両方の側で閉ざされた具体的な範囲へと変換できます。

source: You can use the magnitude property in operations that are simpler to implement in terms of unsigned values, such as printing the value of an integer, which is just printing a ‘-’ character in front of an absolute value.
ja: あなたは、magnitudeプロパティを、ずっと単純に符号なしの値に関して実装する演算において使用できます、例えば整数の値を印字することなど、それはちょっと「-」文字を絶対値の前に印字しています。

source: You can use the pattern-matching operator (~=) to test whether a value is included in a range.
ja: あなたは、このパターンマッチング演算子（~=）を使うことで、ある値がある範囲に含まれるかどうか検査できます。

source: You can use the predicate to check for an element of a type that doesn’t conform to the Equatable protocol, such as the HTTPResponse enumeration in this example.
ja: あなたは述部を使って、Equatableプロトコルに準拠しない型、例えばこの例でのHTTPResponse列挙などの要素に対して調べることができます。

source: You can use the predicate to find an element of a type that doesn’t conform to the Equatable protocol or to find an element that matches particular criteria.
ja: あなたは述部を使って、Equatableプロトコルに準拠しない型の要素を見つける、または特定の基準に合致する要素を見つけることができます。

source: You can use the same or a different name than your Objective-C class.
ja: あなたは、あなたのObjective-Cクラスと同じまたは異なる名前を使用することができます。

source: You can use the unary plus operator (+) to provide symmetry in your code for positive numbers when also using the unary minus operator.
ja: あなたは、単行プラス演算子（+）を使うことで、均整美をあなたのコードにおいて正の数に対して単行マイナス演算子もまた使う場合に提供できます。

source: You can use this method to find the distance in bytes that can be added to a pointer of type T to get a pointer to the property referenced by key.
ja: あなたはこのメソッドを使ってバイトでの隔たりを見つけることができます、それは型Tのポインタに加えることで、keyによって参照されるプロパティへのポインタを得ることができるものです。

source: You can use this type of partial range of a collection’s indices to represent the range from the partial range’s lower bound up to the end of the collection.
ja: あなたは、あるコレクションのインデックスからなる、この型の部分的範囲を使うことで、その部分的な範囲の下側の境界からそのコレクションの終わりまでの範囲を表すことができます。

source: You can use this type of partial range of a collection’s indices to represent the range from the start of the collection up to, and including, the partial range’s upper bound.
ja: あなたは、あるコレクションのインデックスからなる、この型の部分的範囲を使うことで、コレクションの始まりからその部分的な範囲の上側の境界までの、そしてそれを含んでいる範囲を表すことができます。

source: You can use this type of partial range of a collection’s indices to represent the range from the start of the collection up to, but not including, the partial range’s upper bound.
ja: あなたは、あるコレクションのインデックスからなる、この型の部分的範囲を使うことで、コレクションの始まりからその部分的な範囲の上側の境界までの、しかしそれを含んでいない範囲を表すことができます。

source: You can write generic methods that operate on any numeric type in the standard library by using the Numeric protocol as a generic constraint.
ja: あなたは、Numericプロトコルを総称体制約として使うことで、標準ライブラリのあらゆる数値型上で作用する総称体メソッドを書くことができます。

source: You can't reorder or change the number of arguments for type members imported using the CF_SWIFT_NAME macro.
ja: あなたは、CF_SWIFT_NAMEマクロを使ってインポートされる型メンバーに対する引数の数を再配列または変更できません。

source: You cannot use * with arguments of different types.
ja: あなたは、*をそれぞれが異なる型である引数で使うことはできません。

source: You cannot use + with arguments of different types.
ja: あなたは、+をそれぞれが異なる型である引数で使うことはできません。

source: You cannot use - with arguments of different types.
ja: あなたは、-をそれぞれが異なる型である引数で使うことはできません。

source: You cannot use a break or continue statement to exit the current call of the body closure or skip subsequent calls.
ja: あなたは、breakまたはcontinue文を使って、bodyクロージャの現在の呼び出しを抜け出したり、または続いて起こる呼び出しを飛ばしたりできません。

source: You create PartialRangeFrom instances by using the postfix range operator (postfix ...).
ja: あなたは、PartialRangeFromインスタンスを後置範囲演算子（...）を使って作成します。

source: You create PartialRangeThrough instances by using the prefix closed range operator (prefix ...).
ja: あなたは、PartialRangeThroughインスタンスを後置範囲演算子（...）を使って作成します。

source: You create PartialRangeUpTo instances by using the prefix half-open range operator (prefix ..<).
ja: あなたは、PartialRangeUpToインスタンスを後置範囲演算子（..<）を使って作成します。

source: You create a Range instance by using the half-open range operator (..<).
ja: あなたは、Rangeインスタンスを、半開範囲演算子（..<）を使うことで作成します。

source: You create an instance of the Repeated collection by calling the repeatElement(_:count:) function.
ja: あなたは、RepeatedコレクションのインスタンスをrepeatElement(_:count:)関数を呼び出すことによって作成します。

source: You don't need to rewrite your entire app in Swift at once.
ja: あなたは、あなたのアプリ全体を一度にSwiftに書き直す必要はありません。

source: You initialize a KeyValuePairs instance using a Swift dictionary literal.
ja: あなたは、KeyValuePairsインスタンスをSwift辞書リテラルを使って初期化します。

source: You make part of an API unavailable in Swift as part of introducing new Swift APIs that supersede parts of the existing Objective-C API.
ja: あなたは、Swiftで利用可能でないAPIの部分を、既存のObjective-C APIの部分に取って代わる新しいSwift APIを導入する部分とします。

source: You might encounter Objective-C code that uses the older NS_STRING_ENUM and NS_EXTENSIBLE_STRING_ENUM macros, which were used to group string constants.
ja: あなたは、より古いNS_STRING_ENUMおよびNS_EXTENSIBLE_STRING_ENUMマクロを使うObjective-Cコードに直面するかもしれません、それは文字列定数をグループにするために使われました。

source: You must not call this method if any other copy of this iterator has been advanced with a call to its next() method.
ja: あなたは、このイテレータの何か他のコピーがそれのnext()メソッドを呼び出すことで前に進められるならば、このメソッドを呼び出す必要はありません。

source: You must unwrap the value of an Optional instance before you can use it in many contexts.
ja: あなたは、あなたがそれを多くの文脈において使う前に、Optionalインスタンスの値をアンラップしなければなりません。

source: You need to know how each function calls its closure if you write code that relies on a specific execution order.
ja: あなたは、各関数がそれのクロージャを呼び出す方法を知る必要があります、もしあなたがある明確な実行順序を当てにするコードを書くならば。

source: You preserve the return value or thrown error from a throwing expression using the Result enumeration’s init(catching:) initializer.
ja: あなたはスローする式から戻り値またはスローされたエラーを、Result列挙の持つinit(catching:)イニシャライザを使って保全します。

source: You rarely need to use iterators directly, because a for-in loop is the more idiomatic approach to traversing a sequence in Swift.
ja: あなたは滅多にイテレータを直に使う必要はありません、なぜならfor-inループはSwiftにおいてシーケンスを辿っていくずっと慣用語法にかなった取り組みだからです。

source: You reuse an API by using its new name to call it in the implementation of a new API in Swift.
ja: あなたはあるAPIを、それの新しい名前を使ってそれをSwiftでの新しいAPIの実装において呼び出すことによって再利用します。

source: You use self in a CF_SWIFT_NAME argument to refer to the instance that the method belongs to.
ja: あなたは、selfをCF_SWIFT_NAME引数において使って、メソッドが属するインスタンスを参照します。

source: You use a set instead of an array when you need to test efficiently for membership and you aren’t concerned with the order of the elements in the collection, or when you need to ensure that each element appears only once in a collection.
ja: あなたが集合を配列の代わりに使うのは、あなたが帰属について能率的にテストする必要がありそしてあなたがコレクションの要素の順番に関心がない場合、または各要素がただ一度だけコレクション中に現れることをあなたが確実にする必要がある場合です。

source: You use one of the following macros to declare that several Objective-C constants are related to each other:
ja: あなたは、以下のマクロの１つを使って、いくつかのObjective-C定数が互いに関連することを宣言します：

source: You use the CF_SWIFT_NAME macro to group together related global functions into a single structure type that's imported into Swift.
ja: あなたは、CF_SWIFT_NAMEマクロを使って、関連するグローバル関数を一緒にして、Swiftにインポートされるある単一の構造体型へとグループにまとめます。

source: You use the NS_OPTIONS macro when two or more constants in a grouping of constants can be combined.
ja: あなたは、NS_OPTIONSマクロを、ある定数グループの中の２つ以上の定数が結合可能である場合に使います。

source: You use the NS_SWIFT_NAME macro as a prefix for classes and protocols.
ja: あなたは、NS_SWIFT_NAMEマクロをクラスとプロパティのための接頭辞として使います。

source: You use the NS_TYPED_ENUM to group constants with a raw value type that you specify.
ja: あなたは、NS_TYPED_ENUMを使って、あなたが指定する生の値型を持つ定数をグループにまとめます。

source: You use the OptionSet protocol to represent bitset types, where individual bits represent members of a set.
ja: あなたは、OptionSetプロトコルを使ってビットセット型を表すことができます、そこにおいて個々のビットはセットのメンバを表します。

source: You use the Optional type whenever you use optional values, even if you never type the word Optional.
ja: あなたはOptional型を、あなたがオプショナル値を使う時はいつでも使います、たとえあなたが単語Optionalを決してタイプしないとしてもです。

source: You use this initializer from within your type’s customMirror implementation to create a customized mirror, particularly for custom types that are collections.
ja: あなたは、このイニシャライザをあなたの型のもつcustomMirror実装内部から使うことで、あつらえのミラーを作成できます、とりわけコレクションであるあつらえの型に対して。

source: You use this initializer from within your type’s customMirror implementation to create a customized mirror.
ja: あなたは、このイニシャライザをあなたの型のもつcustomMirror実装内部から使うことで、あつらえのミラーを作成できます。

source: You use this method to randomize the elements of a collection when you are using a custom random number generator.
ja: あなたはこのメソッドを使って、あなたがあつらえの無作為数生成子を使っている場合に、あるコレクションの要素を無作為化します。

source: You use this method to randomize the elements of a sequence when you are using a custom random number generator.
ja: あなたはこのメソッドを使って、あなたがあつらえの無作為数生成子を使っている場合に、あるシーケンスの要素を無作為化します。

source: You use types that conform to the SetAlgebra protocol when you need efficient membership tests or mathematical set operations such as intersection, union, and subtraction.
ja: あなたがSetAlgebraプロトコルに準拠する型を使うのは、あなたが帰属について能率的にテストするか、数学的集合演算たとえば交叉、合併、そして差分を必要とする場合です。

source: You won’t create a header file; Xcode generates a header automatically in case you need to reference it.
ja: あなたはヘッダ・ファイルを作成しません；あなたがそれに参照をつける必要がある場合に備えて、Xcodeが自動的にヘッダを生成します。

source: You'll need to consider this kind of time-based execution problem frequently when using APIs that take closures.
ja: あなたは、クロージャを取るAPIを使う場合に、この種の時間基盤の実行問題をしばしば考える必要があるでしょう。

source: You've ever added cases to an enumeration after its initial declaration
ja: あなたが決してケース節を、ある列挙に対してそれの最初の宣言の後に加えないならば

source: You’ll replace the .m and .h files for that class with a single .swift file.
ja: あなたは、そのクラスのための.mと.hファイルを単一の.swiftファイルで置き換えます。

source: Zero is a multiple of everything because 0 = 0*x for any integer x.
ja: ゼロはあらゆるものの倍数です、なぜなら0 = 0*xなので、どんな整数xに対してもです。

source: Zero is the identity element for addition.
ja: ゼロは加算に対する単位元です。

source: if this set and other contain elements that are equal but distinguishable (e.g. via ===), which of these elements is present in the result is unspecified.
ja: この集合とotherが等しいけれども区別可能な要素を含むならば（たとえば===によって）、それらの要素のどれが結果の存在するのかは不特定です。
